{
  "opt_out_submission_id": "vqxa9h",
  "template": "It looks like you mentioned Hasan Piker. In case you weren't already aware, Hasan is a far-left political edutainer wannabe, a hypocrite, and an all-around mental midget. Have one of his hot takes:\n\n> {quote}",
  "footnote": "*****\n^(I'm a bot. My purpose is to counteract online radicalization. You can summon me by tagging thehasanpikerbot. Options {options})\n\n [^(Project GitHub -- please consider submitting quotes!)](https://github.com/Confused3731/thepunditbot) ^| ^(Thank you to u/thebenshapirobot for the GPLv3 code <3) ^| [^(Opt Out)](https://np.reddit.com/r/thepunditbot/comments/vqxa9h/click_here_to_opt_out_of_thehasanpikerbot/)",
  "quotes": [
    "absolutely insane that twitch banned two of my mods for using the word cracker. one of is black and the other is brown. does twitch actually believe cracker is a slur?",
    "this is the hill i will die on. russia cannot launch an urban counter insurgency war in a neighboring country w/ 44 million ppl. with or without nato support. this is why i have been saying he won’t invade ukraine. not because of anything else. he’s a bad person not a mad one.",
    "listening to npr reporters confused abt why the people on the ground in ukraine are calm when 'a russian invasion is imminent!' is hilarious. theyre confused why no ones taking money out or leaving the towns. maybe its because the ukranians dont watch american news everyday.",
    "No, I didn’t say, ‘Americans deserve 9/11,’ I said, ‘America deserves 9/11",
    "Jussie [Smollett] is a well off and celebrated actor and he was still called homophobic slurs and had a rope tied around his neck... For bigots and horrible people, the color of your skin, or who you love is all they need to know to write you off, to hate you and even attack you. Their struggle does not take away anything from yours",
    "republicans are going to pass a second relief bill with incredible provisions like 'your employer is now legally allowed to murder you' with a much smaller amount of cash for the communities that desperately need it - and we're going to hear about bipartisanship for 4 years",
    "America Deserved 9/11, dude. Fuck it, I'm saying it.",
    "I didn't say Americans deserved 9/11 -- I said America deserves 9/11",
    "[With respect to Texas Congressman Dan Crenshaw and former Navy SEAL who lost an eye in Afghanistan] This guy has the understanding of foreign policy of, like, a 12 year-old. What the fuck is wrong with this dude? Didn't he go to war and like literally lose his eye because some mujahideen -- A brave fucking soldier fucked his eye hole with their dick? Isn't that how he lost his fucking dumbass eye, cuz he got his fucking eye hole fucked?",
    "NATO is 1000% an aggressor outside fucking force. Ok? Russia is not. Russia annexing its own fucking territory that it's had -- that it's own territory full of its own fucking people is not the same as NATO being like 'We're going to turn your country into a fucking base and put literal military bases and rockets into your country'",
    "I don't give a fuck about the Ukranian border sovereignty.",
    "You feeling bad about the Crimean annexiation does not change the reality of the Crimean annexation being a completely justifiable fucking act by the Russian government. Ok? So that's it.",
    "[With respect to the Russian invastion of Ukraine] Talk to me when he's throwing Ukranians in a concentration camp. Ok?",
    "[With respect to his stream title] I think I'll just change this everyday to 'Ukraine has still not been invaded by Russia' and its like day 11 at this point.",
    "[With respect to a video of cops being beaten by rioters] If you feel sadness in your hearts when you see these piglets get dragged like this just remember: who do you think threw the first punch?",
    "[With respect to Roe v. Wade being overturned] Shouts out to Ruth Bader Ginsburg. She's burning in fucking hell right now. This is her goddamn legacy. Good job Ruth!",
    "I am an advocate -- I am of the mindset that civilized countries allow its citizens to fucking brawl with cops... The only counties outside of the United States where people can't brawl with cops are dictatorships.",
    "absolutely insane that twitch banned two of my mods for using the word cracker. one of is black and the other is brown. does twitch actually believe cracker is a slur?",
    "scott pruitt's mere existence justifies bringing back guillotines. as someone who is pro-life it brings me no joy to report this"
  ],
  "shitposts": {
    "covid": [
      "republicans are going to pass a second relief bill with incredible provisions like 'your employer is now legally allowed to murder you' with a much smaller amount of cash for the communities that desperately need it - and we're going to hear about bipartisanship for 4 years"
    ],
    "ukraine": [
      "this is the hill i will die on. russia cannot launch an urban counter insurgency war in a neighboring country w/ 44 million ppl. with or without nato support. this is why i have been saying he won’t invade ukraine. not because of anything else. he’s a bad person not a mad one.",
      "listening to npr reporters confused abt why the people on the ground in ukraine are calm when 'a russian invasion is imminent!' is hilarious. theyre confused why no ones taking money out or leaving the towns. maybe its because the ukranians dont watch american news everyday.",
      "Ukraine has still not been invaded by Russia.",
      "Hitler wasn't fucking bad because he decided to invade Austria, he was bad because he was fucking killing Jews! Ok? That was the problem! He wasn't like, Oh yeah we're gonna fucking annex territory with like Germanic people in it . That wasn't the main problem with Hitler! I think? That was like maybe 8th down the line!",
      "NATO is 1000% an aggressor outside fucking force. Ok? Russia is not. Russia annexing its own fucking territory that it's had -- that it's own territory full of its own fucking people is not the same as NATO being like 'We're going to turn your country into a fucking base and put literal military bases and rockets into your country",
      "I don't give a fuck about the Ukranian border sovereignty.",
      "You feeling bad about the Crimean annexiation does not change the reality of the Crimean annexation being a completely justifiable fucking act by the Russian government. Ok? So that's it.",
      "[With respect to the Russian invastion of Ukraine] Talk to me when he's throwing Ukranians in a concentration camp. Ok?",
      "I am more critical of the Russian actions of yesterday than the American government is. Ok? Just understand that",
      "I was right about Ukraine. Shocker!",
      "[With respect to his stream title] I think I'll just change this everyday to 'Ukraine has still not been invaded by Russia' and its like day 11 at this point.",
      "[Reacting to SSSniperWolf's house tour] Dude this is like unimaginable wealth dude. How the fuck do people make this much money? 2.9 million dollars near Las Vegas? Dude... Oh my fucking lord you could buy a fucking castle in Vegas. [Hasan, the 'Eat The Rich' socialist, would go on to buy a $2.75 million five-bedroom home in West Hollywood along with a $200,000 Porsche Taycan]"
    ],
    "smollett": [
      "Jussie [Smollett] is a well off and celebrated actor and he was still called homophobic slurs and had a rope tied around his neck... For bigots and horrible people, the color of your skin, or who you love is all they need to know to write you off, to hate you and even attack you. Their struggle does not take away anything from yours"
    ],
    "9/11": [
      "No, I didn’t say, ‘Americans deserve 9/11,’ I said, ‘America deserves 9/11",
      "America Deserved 9/11, dude. Fuck it, I'm saying it."
    ],
    "insult": [
      "What a fucking liar, dude. What a fucking, weaselly, little liar, dude. What a fucking, weaselly little LIAR, dude. Holy shit, dude. Holy fucking shit, dude. Literally lying, STILL LYING to his audience. Can someone at least fucking enlighten Destiny that he's literally lying to his audience? What a fucking piece of shit, dude. Holy fucking shit, dude.",
      "[With respect to Texas Congressman Dan Crenshaw and former Navy SEAL who lost an eye in Afghanistan] This guy has the understanding of foreign policy of, like, a 12 year-old. What the fuck is wrong with this dude? Didn't he go to war and like literally lose his eye because some mujahideen -- A brave fucking soldier fucked his eye hole with their dick? Isn't that how he lost his fucking dumbass eye, cuz he got his fucking eye hole fucked?"
    ],
    "abortion": [
      "Shouts out to Ruth Bader Ginsburg. She's burning in fucking hell right now. This is her goddamn legacy. Good job Ruth!",
      "scott pruitt's mere existence justifies bringing back guillotines. as someone who is pro-life it brings me no joy to report this"
    ],
    "hypocrite": [
      "[Reacting to SSSniperWolf's house tour] Dude this is like unimaginable wealth dude. How the fuck do people make this much money? 2.9 million dollars near Las Vegas? Dude... Oh my fucking lord you could buy a fucking castle in Vegas. [Hasan, the 'Eat The Rich' socialist, would go on to buy a $2.75 million five-bedroom home in West Hollywood along with a $200,000 Porsche Taycan]"
    ]
  },
  "good_bot": [
    "What a fucking liar, dude. What a fucking, weaselly, little liar, dude. What a fucking, weaselly little LIAR, dude. Holy shit, dude. Holy fucking shit, dude. Literally lying, STILL LYING to his audience. Can someone at least fucking enlighten {replying_username} that he's literally lying to his audience? What a fucking piece of shit, dude. Holy fucking shit, dude.",
    "have fun getting covid at applebees mf",
    "This guy {replying_username} has the understanding of foreign policy of, like, a 12 year-old. What the fuck is wrong with this dude? Didn't he go to war and like literally lose his eye because some mujahideen -- A brave fucking soldier fucked his eye hole with their dick? Isn't that how he lost his fucking dumbass eye, cuz he got his fucking eye hole fucked?"
  ],
  "bad_bot": [
    "it’s wild how the internet chooses villains. i do my best to be a good person everyday and ofc i have flaws. idk what people want from me."
  ]
}
